benchmark/logs/rook-ceph-nfs.log
root@k8s-node1:~/benchmark/rook# k logs -f rook-nfs-dbench-job-rb7t2 
Working dir: /tmp

Testing Read IOPS...
fio: posix_fallocate fails: Not supported
read_iops: (g=0): rw=randread, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process
read_iops: Laying out IO file(s) (1 file(s) / 2048MiB)

read_iops: (groupid=0, jobs=1): err= 0: pid=11: Mon May  8 04:19:25 2023
   read: IOPS=8876, BW=34.8MiB/s (36.4MB/s)(521MiB/15028msec)
  cpu          : usr=1.10%, sys=6.22%, ctx=213940, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=120.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=133389,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=34.8MiB/s (36.4MB/s), 34.8MiB/s-34.8MiB/s (36.4MB/s-36.4MB/s), io=521MiB (547MB), run=15028-15028msec


Testing Write IOPS...
write_iops: (g=0): rw=randwrite, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

write_iops: (groupid=0, jobs=1): err= 0: pid=21: Mon May  8 04:19:43 2023
  write: IOPS=3528, BW=13.9MiB/s (14.5MB/s)(207MiB/15018msec)
  cpu          : usr=0.69%, sys=3.35%, ctx=60066, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=115.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,52994,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=13.9MiB/s (14.5MB/s), 13.9MiB/s-13.9MiB/s (14.5MB/s-14.5MB/s), io=207MiB (217MB), run=15018-15018msec


Testing Read Bandwidth...
read_bw: (g=0): rw=randread, bs=128KiB-128KiB,128KiB-128KiB,128KiB-128KiB, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

read_bw: (groupid=0, jobs=1): err= 0: pid=31: Mon May  8 04:20:01 2023
   read: IOPS=925, BW=116MiB/s (122MB/s)(1762MiB/15168msec)
  cpu          : usr=0.25%, sys=0.94%, ctx=27365, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=114.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=14036,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=116MiB/s (122MB/s), 116MiB/s-116MiB/s (122MB/s-122MB/s), io=1762MiB (1848MB), run=15168-15168msec


Testing Write Bandwidth...
write_bw: (g=0): rw=randwrite, bs=128KiB-128KiB,128KiB-128KiB,128KiB-128KiB, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

write_bw: (groupid=0, jobs=1): err= 0: pid=41: Mon May  8 04:20:18 2023
  write: IOPS=1136, BW=143MiB/s (149MB/s)(2147MiB/15062msec)
  cpu          : usr=1.97%, sys=1.66%, ctx=19133, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=120.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,17116,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=143MiB/s (149MB/s), 143MiB/s-143MiB/s (149MB/s-149MB/s), io=2147MiB (2252MB), run=15062-15062msec


Testing Read Latency...
read_latency: (g=0): rw=randread, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=4
fio-2.17-45-g06cb
Starting 1 process

read_latency: (groupid=0, jobs=1): err= 0: pid=51: Mon May  8 04:20:36 2023
   read: IOPS=3680, BW=14.4MiB/s (15.8MB/s)(216MiB/15002msec)
    slat (usec): min=2, max=2683, avg=11.47, stdev=17.11
    clat (usec): min=3, max=15484, avg=1074.21, stdev=1153.79
     lat (usec): min=114, max=15494, avg=1085.84, stdev=1153.91
    clat percentiles (usec):
     |  1.00th=[  251],  5.00th=[  282], 10.00th=[  298], 20.00th=[  318],
     | 30.00th=[  338], 40.00th=[  362], 50.00th=[  386], 60.00th=[  458],
     | 70.00th=[ 2288], 80.00th=[ 2352], 90.00th=[ 2448], 95.00th=[ 2800],
     | 99.00th=[ 4192], 99.50th=[ 5536], 99.90th=[ 9792], 99.95th=[11200],
     | 99.99th=[13632]
    lat (usec) : 4=0.01%, 50=0.01%, 100=0.01%, 250=0.89%, 500=61.03%
    lat (usec) : 750=5.98%, 1000=0.89%
    lat (msec) : 2=0.60%, 4=29.41%, 10=1.10%, 20=0.09%
  cpu          : usr=0.51%, sys=2.57%, ctx=106671, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=114.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=55220,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=14.4MiB/s (15.8MB/s), 14.4MiB/s-14.4MiB/s (15.8MB/s-15.8MB/s), io=216MiB (226MB), run=15002-15002msec


Testing Write Latency...
write_latency: (g=0): rw=randwrite, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=4
fio-2.17-45-g06cb
Starting 1 process

write_latency: (groupid=0, jobs=1): err= 0: pid=61: Mon May  8 04:20:53 2023
  write: IOPS=1084, BW=4338KiB/s (4442kB/s)(63.6MiB/15010msec)
    slat (usec): min=4, max=2628, avg=25.51, stdev=23.98
    clat (msec): min=2, max=20, avg= 3.66, stdev= 1.37
     lat (msec): min=2, max=20, avg= 3.69, stdev= 1.37
    clat percentiles (usec):
     |  1.00th=[ 2640],  5.00th=[ 2672], 10.00th=[ 2672], 20.00th=[ 2704],
     | 30.00th=[ 2768], 40.00th=[ 2832], 50.00th=[ 2896], 60.00th=[ 3056],
     | 70.00th=[ 4832], 80.00th=[ 4960], 90.00th=[ 5152], 95.00th=[ 5536],
     | 99.00th=[ 8256], 99.50th=[10176], 99.90th=[14528], 99.95th=[16064],
     | 99.99th=[20352]
    lat (msec) : 4=67.29%, 10=32.19%, 20=0.53%, 50=0.01%
  cpu          : usr=0.55%, sys=1.62%, ctx=31951, majf=0, minf=3
  IO depths    : 1=0.1%, 2=0.1%, 4=111.9%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,16274,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=4338KiB/s (4442kB/s), 4338KiB/s-4338KiB/s (4442kB/s-4442kB/s), io=63.6MiB (66.7MB), run=15010-15010msec


Testing Read Sequential Speed...
fio: posix_fallocate fails: Not supported
read_seq: (g=0): rw=read, bs=1024KiB-1024KiB,1024KiB-1024KiB,1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-2.17-45-g06cb
Starting 4 threads
read_seq: Laying out IO file(s) (1 file(s) / 3548MiB)

read_seq: (groupid=0, jobs=1): err= 0: pid=71: Mon May  8 04:21:35 2023
   read: IOPS=86, BW=87.3MiB/s (91.6MB/s)(1339MiB/15340msec)
  cpu          : usr=0.05%, sys=0.29%, ctx=2083, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=0.6%, 16=114.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1324,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=72: Mon May  8 04:21:35 2023
   read: IOPS=74, BW=75.7MiB/s (79.4MB/s)(1168MiB/15439msec)
  cpu          : usr=0.05%, sys=0.23%, ctx=1812, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=0.7%, 16=115.1%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1153,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=73: Mon May  8 04:21:35 2023
   read: IOPS=95, BW=96.8MiB/s (101MB/s)(1492MiB/15419msec)
  cpu          : usr=0.03%, sys=0.38%, ctx=2224, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.3%, 8=0.5%, 16=115.8%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1477,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=74: Mon May  8 04:21:35 2023
   read: IOPS=82, BW=83.7MiB/s (87.8MB/s)(1291MiB/15431msec)
  cpu          : usr=0.05%, sys=0.24%, ctx=1865, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=0.6%, 16=114.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1276,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=343MiB/s (359MB/s), 75.7MiB/s-96.8MiB/s (79.4MB/s-101MB/s), io=5290MiB (5547MB), run=15340-15439msec


Testing Write Sequential Speed...
write_seq: (g=0): rw=write, bs=1024KiB-1024KiB,1024KiB-1024KiB,1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-2.17-45-g06cb
Starting 4 threads

write_seq: (groupid=0, jobs=1): err= 0: pid=84: Mon May  8 04:21:53 2023
  write: IOPS=35, BW=36.7MiB/s (38.5MB/s)(563MiB/15349msec)
  cpu          : usr=0.46%, sys=0.36%, ctx=692, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.4%, 4=0.7%, 8=1.5%, 16=113.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.2%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,548,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=85: Mon May  8 04:21:53 2023
  write: IOPS=35, BW=36.1MiB/s (38.7MB/s)(566MiB/15342msec)
  cpu          : usr=0.37%, sys=0.48%, ctx=656, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.4%, 4=0.7%, 8=1.5%, 16=113.1%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.2%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,551,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=86: Mon May  8 04:21:53 2023
  write: IOPS=38, BW=39.3MiB/s (41.2MB/s)(611MiB/15579msec)
  cpu          : usr=0.53%, sys=0.33%, ctx=718, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.3%, 16=115.3%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,596,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=87: Mon May  8 04:21:53 2023
  write: IOPS=35, BW=36.4MiB/s (38.9MB/s)(557MiB/15335msec)
  cpu          : usr=0.46%, sys=0.37%, ctx=715, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.4%, 4=0.7%, 8=1.5%, 16=114.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.2%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,542,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=147MiB/s (155MB/s), 36.4MiB/s-39.3MiB/s (38.9MB/s-41.2MB/s), io=2297MiB (2409MB), run=15335-15579msec


Testing Read/Write Mixed...
rw_mix: (g=0): rw=randrw, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

rw_mix: (groupid=0, jobs=1): err= 0: pid=97: Mon May  8 04:22:10 2023
   read: IOPS=4766, BW=18.7MiB/s (19.6MB/s)(280MiB/15022msec)
  write: IOPS=1592, BW=6378KiB/s (6531kB/s)(93.6MiB/15022msec)
  cpu          : usr=1.17%, sys=5.87%, ctx=127437, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=118.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=71604,23918,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=18.7MiB/s (19.6MB/s), 18.7MiB/s-18.7MiB/s (19.6MB/s-19.6MB/s), io=280MiB (293MB), run=15022-15022msec
  WRITE: bw=6378KiB/s (6531kB/s), 6378KiB/s-6378KiB/s (6531kB/s-6531kB/s), io=93.6MiB (98.2MB), run=15022-15022msec


All tests complete.

==================
= Dbench Summary =
==================
Random Read/Write IOPS: 8876/3528. BW: 116MiB/s / 143MiB/s
Average Latency (usec) Read/Write: 1085.84/
Sequential Read/Write: 343MiB/s / 147MiB/s
Mixed Random Read/Write IOPS: 4766/1592